

"""     Python деген эмне?
    Python популярдуу программалоо тили болуп саналат. 
Ал Гидо ван Россум тарабынан түзүлгөн жана 1991-жылы жарык көргөн.

Бул үчүн колдонулат:

веб-иштеп чыгуу (сервер тарапта),
программалык камсыздоону иштеп чыгуу,
математика,
системалык сценарий. 
"""


#####################
""" Комментарийлер Python кодун түшүндүрүү үчүн колдонулушу мүмкүн.

Кодду окууга ыңгайлуу кылуу үчүн комментарийлерди колдонсо болот.

Комментарийлер кодду сынап жатканда аткарылышын алдын алуу үчүн колдонулушу мүмкүн.

Комментарий түзүү
Комментарийлер менен башталат #жана Python аларга көңүл бурбайт:"""
#This is a comment
#print("Hello, World!")




#Функция print
print('Резутьтат :', 5, 7, '.', sep='|')








# Python имеет возможность комментирования для документации в коде.

# Комментарии начинаются с #, а оставшуюся часть строки Python отобразит как комментарий:
# """
# математикалык операторлор
# + Кошуу оператору
# - Кемитуу оператору
# * Кобойтуу оператору
# % - Нольго кобойтуу
# / - болуу
# -= дикремент
# += инкремент
"""   
>=  чон 
<=  кичине
!= не равно барабар эмес
== барабар равно 



озгорбоочу

1>>> int
1>>> float 3.33
3>>> complex 3j           
4>>> bool                true==1 false ==0
5>>> str string      
6>>> tuple кортеж 
7>>> frozenset



озгоруучу типы данных 

1>>> list 
2>>> dict 
3>>> set множества """


# '' --> одинарный кавычка
# "" --> двоной 
# """ """ --> тройной 

